Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM7_fdcan1.h
// ILE Configuration

#define FDCAN1_ILE_EINT1        (0x1u<<1)
#define FDCAN1_ILE_EINT0        (0x1u<<0)

// GFC Configuration

#define FDCAN1_GFC_ANFS         (0x3u<<4)
#define FDCAN1_GFC_ANFS_0       (0x1u<<4)
#define FDCAN1_GFC_ANFE         (0x3u<<2)
#define FDCAN1_GFC_ANFE_0       (0x1u<<2)
#define FDCAN1_GFC_RRFS         (0x1u<<1)
#define FDCAN1_GFC_RRFE         (0x1u<<0)

// SIDFC Configuration

#define FDCAN1_SIDFC_LSS        (0xFFu<<16)
#define FDCAN1_SIDFC_LSS_0      (0x1u<<16)
#define FDCAN1_SIDFC_FLSSA      (0x3FFFu<<2)
#define FDCAN1_SIDFC_FLSSA_0    (0x1u<<2)

// XIDFC Configuration

#define FDCAN1_XIDFC_LSE        (0xFFu<<16)
#define FDCAN1_XIDFC_LSE_0      (0x1u<<16)
#define FDCAN1_XIDFC_FLESA      (0x3FFFu<<2)
#define FDCAN1_XIDFC_FLESA_0    (0x1u<<2)

// XIDAM Configuration

#define FDCAN1_XIDAM_EIDM       (0x1FFFFFFFu<<0)
#define FDCAN1_XIDAM_EIDM_0     (0x1u<<0)

// HPMS Configuration

#define FDCAN1_HPMS_FLST        (0x1u<<15)
#define FDCAN1_HPMS_FIDX        (0x7Fu<<8)
#define FDCAN1_HPMS_FIDX_0      (0x1u<<8)
#define FDCAN1_HPMS_MSI         (0x3u<<6)
#define FDCAN1_HPMS_MSI_0       (0x1u<<6)
#define FDCAN1_HPMS_BIDX        (0x3Fu<<0)
#define FDCAN1_HPMS_BIDX_0      (0x1u<<0)

// NDAT1 Configuration

#define FDCAN1_NDAT1_ND31       (0x1u<<31)
#define FDCAN1_NDAT1_ND30       (0x1u<<30)
#define FDCAN1_NDAT1_ND29       (0x1u<<29)
#define FDCAN1_NDAT1_ND28       (0x1u<<28)
#define FDCAN1_NDAT1_ND27       (0x1u<<27)
#define FDCAN1_NDAT1_ND26       (0x1u<<26)
#define FDCAN1_NDAT1_ND25       (0x1u<<25)
#define FDCAN1_NDAT1_ND24       (0x1u<<24)
#define FDCAN1_NDAT1_ND23       (0x1u<<23)
#define FDCAN1_NDAT1_ND22       (0x1u<<22)
#define FDCAN1_NDAT1_ND21       (0x1u<<21)
#define FDCAN1_NDAT1_ND20       (0x1u<<20)
#define FDCAN1_NDAT1_ND19       (0x1u<<19)
#define FDCAN1_NDAT1_ND18       (0x1u<<18)
#define FDCAN1_NDAT1_ND17       (0x1u<<17)
#define FDCAN1_NDAT1_ND16       (0x1u<<16)
#define FDCAN1_NDAT1_ND15       (0x1u<<15)
#define FDCAN1_NDAT1_ND14       (0x1u<<14)
#define FDCAN1_NDAT1_ND13       (0x1u<<13)
#define FDCAN1_NDAT1_ND12       (0x1u<<12)
#define FDCAN1_NDAT1_ND11       (0x1u<<11)
#define FDCAN1_NDAT1_ND10       (0x1u<<10)
#define FDCAN1_NDAT1_ND9        (0x1u<<9)
#define FDCAN1_NDAT1_ND8        (0x1u<<8)
#define FDCAN1_NDAT1_ND7        (0x1u<<7)
#define FDCAN1_NDAT1_ND6        (0x1u<<6)
#define FDCAN1_NDAT1_ND5        (0x1u<<5)
#define FDCAN1_NDAT1_ND4        (0x1u<<4)
#define FDCAN1_NDAT1_ND3        (0x1u<<3)
#define FDCAN1_NDAT1_ND2        (0x1u<<2)
#define FDCAN1_NDAT1_ND1        (0x1u<<1)
#define FDCAN1_NDAT1_ND0        (0x1u<<0)

// NDAT2 Configuration

#define FDCAN1_NDAT2_ND63       (0x1u<<31)
#define FDCAN1_NDAT2_ND62       (0x1u<<30)
#define FDCAN1_NDAT2_ND61       (0x1u<<29)
#define FDCAN1_NDAT2_ND60       (0x1u<<28)
#define FDCAN1_NDAT2_ND59       (0x1u<<27)
#define FDCAN1_NDAT2_ND58       (0x1u<<26)
#define FDCAN1_NDAT2_ND57       (0x1u<<25)
#define FDCAN1_NDAT2_ND56       (0x1u<<24)
#define FDCAN1_NDAT2_ND55       (0x1u<<23)
#define FDCAN1_NDAT2_ND54       (0x1u<<22)
#define FDCAN1_NDAT2_ND53       (0x1u<<21)
#define FDCAN1_NDAT2_ND52       (0x1u<<20)
#define FDCAN1_NDAT2_ND51       (0x1u<<19)
#define FDCAN1_NDAT2_ND50       (0x1u<<18)
#define FDCAN1_NDAT2_ND49       (0x1u<<17)
#define FDCAN1_NDAT2_ND48       (0x1u<<16)
#define FDCAN1_NDAT2_ND47       (0x1u<<15)
#define FDCAN1_NDAT2_ND46       (0x1u<<14)
#define FDCAN1_NDAT2_ND45       (0x1u<<13)
#define FDCAN1_NDAT2_ND44       (0x1u<<12)
#define FDCAN1_NDAT2_ND43       (0x1u<<11)
#define FDCAN1_NDAT2_ND42       (0x1u<<10)
#define FDCAN1_NDAT2_ND41       (0x1u<<9)
#define FDCAN1_NDAT2_ND40       (0x1u<<8)
#define FDCAN1_NDAT2_ND39       (0x1u<<7)
#define FDCAN1_NDAT2_ND38       (0x1u<<6)
#define FDCAN1_NDAT2_ND37       (0x1u<<5)
#define FDCAN1_NDAT2_ND36       (0x1u<<4)
#define FDCAN1_NDAT2_ND35       (0x1u<<3)
#define FDCAN1_NDAT2_ND34       (0x1u<<2)
#define FDCAN1_NDAT2_ND33       (0x1u<<1)
#define FDCAN1_NDAT2_ND32       (0x1u<<0)

// RXF0C Configuration

#define FDCAN1_RXF0C_F0WM       (0xFFu<<24)
#define FDCAN1_RXF0C_F0WM_0     (0x1u<<24)
#define FDCAN1_RXF0C_F0S        (0xFFu<<16)
#define FDCAN1_RXF0C_F0S_0      (0x1u<<16)
#define FDCAN1_RXF0C_F0SA       (0x3FFFu<<2)
#define FDCAN1_RXF0C_F0SA_0     (0x1u<<2)

// RXF0S Configuration

#define FDCAN1_RXF0S_RF0L       (0x1u<<25)
#define FDCAN1_RXF0S_F0F        (0x1u<<24)
#define FDCAN1_RXF0S_F0P        (0x3Fu<<16)
#define FDCAN1_RXF0S_F0P_0      (0x1u<<16)
#define FDCAN1_RXF0S_F0G        (0x3Fu<<8)
#define FDCAN1_RXF0S_F0G_0      (0x1u<<8)
#define FDCAN1_RXF0S_F0FL       (0x7Fu<<0)
#define FDCAN1_RXF0S_F0FL_0     (0x1u<<0)

// RXF0A Configuration

#define FDCAN1_RXF0A_FA01       (0x3Fu<<0)
#define FDCAN1_RXF0A_FA01_0     (0x1u<<0)

// RXBC Configuration

#define FDCAN1_RXBC_RBSA        (0x3FFFu<<2)
#define FDCAN1_RXBC_RBSA_0      (0x1u<<2)

// RXF1C Configuration

#define FDCAN1_RXF1C_F1WM       (0x7Fu<<24)
#define FDCAN1_RXF1C_F1WM_0     (0x1u<<24)
#define FDCAN1_RXF1C_F1S        (0x7Fu<<16)
#define FDCAN1_RXF1C_F1S_0      (0x1u<<16)
#define FDCAN1_RXF1C_F1SA       (0x3FFFu<<2)
#define FDCAN1_RXF1C_F1SA_0     (0x1u<<2)

// RXF1S Configuration

#define FDCAN1_RXF1S_DMS        (0x3u<<30)
#define FDCAN1_RXF1S_DMS_0      (0x1u<<30)
#define FDCAN1_RXF1S_RF1L       (0x1u<<25)
#define FDCAN1_RXF1S_F1F        (0x1u<<24)
#define FDCAN1_RXF1S_F1PI       (0x7Fu<<16)
#define FDCAN1_RXF1S_F1PI_0     (0x1u<<16)
#define FDCAN1_RXF1S_F1GI       (0x7Fu<<8)
#define FDCAN1_RXF1S_F1GI_0     (0x1u<<8)
#define FDCAN1_RXF1S_F1FL       (0x7Fu<<0)
#define FDCAN1_RXF1S_F1FL_0     (0x1u<<0)

// RXF1A Configuration

#define FDCAN1_RXF1A_F1AI       (0x3Fu<<0)
#define FDCAN1_RXF1A_F1AI_0     (0x1u<<0)

// RXESC Configuration

#define FDCAN1_RXESC_RBDS       (0x7u<<8)
#define FDCAN1_RXESC_RBDS_0     (0x1u<<8)
#define FDCAN1_RXESC_F1DS       (0x7u<<4)
#define FDCAN1_RXESC_F1DS_0     (0x1u<<4)
#define FDCAN1_RXESC_F0DS       (0x7u<<0)
#define FDCAN1_RXESC_F0DS_0     (0x1u<<0)

// TXBC Configuration

#define FDCAN1_TXBC_TFQM        (0x1u<<30)
#define FDCAN1_TXBC_TFQS        (0x3Fu<<24)
#define FDCAN1_TXBC_TFQS_0      (0x1u<<24)
#define FDCAN1_TXBC_NDTB        (0x3Fu<<16)
#define FDCAN1_TXBC_NDTB_0      (0x1u<<16)
#define FDCAN1_TXBC_TBSA        (0x3FFFu<<2)
#define FDCAN1_TXBC_TBSA_0      (0x1u<<2)

