Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM7_fdcan1.h
// TXFQS Configuration

#define FDCAN1_TXFQS_TFQF       (0x1u<<21)
#define FDCAN1_TXFQS_TFQPI      (0x1Fu<<16)
#define FDCAN1_TXFQS_TFQPI_0    (0x1u<<16)
#define FDCAN1_TXFQS_TFGI       (0x1Fu<<8)
#define FDCAN1_TXFQS_TFGI_0     (0x1u<<8)
#define FDCAN1_TXFQS_TFFL       (0x3Fu<<0)
#define FDCAN1_TXFQS_TFFL_0     (0x1u<<0)

// TXESC Configuration

#define FDCAN1_TXESC_TBDS       (0x7u<<0)
#define FDCAN1_TXESC_TBDS_0     (0x1u<<0)

// TXBRP Configuration

#define FDCAN1_TXBRP_TRP        (0xFFFFFFFFu<<0)
#define FDCAN1_TXBRP_TRP_0      (0x1u<<0)

// TXBAR Configuration

#define FDCAN1_TXBAR_AR         (0xFFFFFFFFu<<0)
#define FDCAN1_TXBAR_AR_0       (0x1u<<0)

// TXBCR Configuration

#define FDCAN1_TXBCR_CR         (0xFFFFFFFFu<<0)
#define FDCAN1_TXBCR_CR_0       (0x1u<<0)

// TXBTO Configuration

#define FDCAN1_TXBTO_TO         (0xFFFFFFFFu<<0)
#define FDCAN1_TXBTO_TO_0       (0x1u<<0)

// TXBCF Configuration

#define FDCAN1_TXBCF_CF         (0xFFFFFFFFu<<0)
#define FDCAN1_TXBCF_CF_0       (0x1u<<0)

// TXBTIE Configuration

#define FDCAN1_TXBTIE_TIE       (0xFFFFFFFFu<<0)
#define FDCAN1_TXBTIE_TIE_0     (0x1u<<0)

// TXBCIE Configuration

#define FDCAN1_TXBCIE_CF        (0xFFFFFFFFu<<0)
#define FDCAN1_TXBCIE_CF_0      (0x1u<<0)

// TXEFC Configuration

#define FDCAN1_TXEFC_EFWM       (0x3Fu<<24)
#define FDCAN1_TXEFC_EFWM_0     (0x1u<<24)
#define FDCAN1_TXEFC_EFS        (0x3Fu<<16)
#define FDCAN1_TXEFC_EFS_0      (0x1u<<16)
#define FDCAN1_TXEFC_EFSA       (0x3FFFu<<2)
#define FDCAN1_TXEFC_EFSA_0     (0x1u<<2)

// TXEFS Configuration

#define FDCAN1_TXEFS_TEFL       (0x1u<<25)
#define FDCAN1_TXEFS_EFF        (0x1u<<24)
#define FDCAN1_TXEFS_EFPI       (0x1Fu<<16)
#define FDCAN1_TXEFS_EFPI_0     (0x1u<<16)
#define FDCAN1_TXEFS_EFGI       (0x1Fu<<8)
#define FDCAN1_TXEFS_EFGI_0     (0x1u<<8)
#define FDCAN1_TXEFS_EFFL       (0x3Fu<<0)
#define FDCAN1_TXEFS_EFFL_0     (0x1u<<0)

// TXEFA Configuration

#define FDCAN1_TXEFA_EFAI       (0x1Fu<<0)
#define FDCAN1_TXEFA_EFAI_0     (0x1u<<0)

// TTTMC Configuration

#define FDCAN1_TTTMC_TME        (0x7Fu<<16)
#define FDCAN1_TTTMC_TME_0      (0x1u<<16)
#define FDCAN1_TTTMC_TMSA       (0x3FFFu<<2)
#define FDCAN1_TTTMC_TMSA_0     (0x1u<<2)

// TTRMC Configuration

#define FDCAN1_TTRMC_RMPS       (0x1u<<31)
#define FDCAN1_TTRMC_XTD        (0x1u<<30)
#define FDCAN1_TTRMC_RID        (0x1FFFFFFFu<<0)
#define FDCAN1_TTRMC_RID_0      (0x1u<<0)

// TTOCF Configuration

#define FDCAN1_TTOCF_EVTP       (0x1u<<26)
#define FDCAN1_TTOCF_ECC        (0x1u<<25)
#define FDCAN1_TTOCF_EGTF       (0x1u<<24)
#define FDCAN1_TTOCF_AWL        (0xFFu<<16)
#define FDCAN1_TTOCF_AWL_0      (0x1u<<16)
#define FDCAN1_TTOCF_EECS       (0x1u<<15)
#define FDCAN1_TTOCF_IRTO       (0x7Fu<<8)
#define FDCAN1_TTOCF_IRTO_0     (0x1u<<8)
#define FDCAN1_TTOCF_LDSDL      (0x7u<<5)
#define FDCAN1_TTOCF_LDSDL_0    (0x1u<<5)
#define FDCAN1_TTOCF_TM         (0x1u<<4)
#define FDCAN1_TTOCF_GEN        (0x1u<<3)
#define FDCAN1_TTOCF_OM         (0x3u<<0)
#define FDCAN1_TTOCF_OM_0       (0x1u<<0)

// TTMLM Configuration

#define FDCAN1_TTMLM_ENTT       (0xFFFu<<16)
#define FDCAN1_TTMLM_ENTT_0     (0x1u<<16)
#define FDCAN1_TTMLM_TXEW       (0xFu<<8)
#define FDCAN1_TTMLM_TXEW_0     (0x1u<<8)
#define FDCAN1_TTMLM_CSS        (0x3u<<6)
#define FDCAN1_TTMLM_CSS_0      (0x1u<<6)
#define FDCAN1_TTMLM_CCM        (0x3Fu<<0)
#define FDCAN1_TTMLM_CCM_0      (0x1u<<0)

// TURCF Configuration

#define FDCAN1_TURCF_ELT        (0x1u<<31)
#define FDCAN1_TURCF_DC         (0x3FFFu<<16)
#define FDCAN1_TURCF_DC_0       (0x1u<<16)
#define FDCAN1_TURCF_NCL        (0xFFFFu<<0)
#define FDCAN1_TURCF_NCL_0      (0x1u<<0)

// TTOCN Configuration

#define FDCAN1_TTOCN_LCKC       (0x1u<<15)
#define FDCAN1_TTOCN_ESCN       (0x1u<<13)
#define FDCAN1_TTOCN_NIG        (0x1u<<12)
#define FDCAN1_TTOCN_TMG        (0x1u<<11)
#define FDCAN1_TTOCN_FGP        (0x1u<<10)
#define FDCAN1_TTOCN_GCS        (0x1u<<9)
#define FDCAN1_TTOCN_TTIE       (0x1u<<8)
#define FDCAN1_TTOCN_TMC        (0x3u<<6)
#define FDCAN1_TTOCN_TMC_0      (0x1u<<6)
#define FDCAN1_TTOCN_RTIE       (0x1u<<5)
#define FDCAN1_TTOCN_SWS        (0x3u<<3)
#define FDCAN1_TTOCN_SWS_0      (0x1u<<3)
#define FDCAN1_TTOCN_SWP        (0x1u<<2)
#define FDCAN1_TTOCN_ECS        (0x1u<<1)
#define FDCAN1_TTOCN_SGT        (0x1u<<0)

// CAN_TTGTP Configuration

#define FDCAN1_CAN_TTGTP_CTP    (0xFFFFu<<16)
#define FDCAN1_CAN_TTGTP_CTP_0  (0x1u<<16)
#define FDCAN1_CAN_TTGTP_NCL    (0xFFFFu<<0)
#define FDCAN1_CAN_TTGTP_NCL_0  (0x1u<<0)

// TTTMK Configuration

#define FDCAN1_TTTMK_LCKM       (0x1u<<31)
#define FDCAN1_TTTMK_TICC       (0x7Fu<<16)
#define FDCAN1_TTTMK_TICC_0     (0x1u<<16)
#define FDCAN1_TTTMK_TM         (0xFFFFu<<0)
#define FDCAN1_TTTMK_TM_0       (0x1u<<0)

// TTIR Configuration

#define FDCAN1_TTIR_CER         (0x1u<<18)
#define FDCAN1_TTIR_AW          (0x1u<<17)
#define FDCAN1_TTIR_WT          (0x1u<<16)
#define FDCAN1_TTIR_IWTG        (0x1u<<15)
#define FDCAN1_TTIR_ELC         (0x1u<<14)
#define FDCAN1_TTIR_SE2         (0x1u<<13)
#define FDCAN1_TTIR_SE1         (0x1u<<12)
#define FDCAN1_TTIR_TXO         (0x1u<<11)
#define FDCAN1_TTIR_TXU         (0x1u<<10)
#define FDCAN1_TTIR_GTE         (0x1u<<9)
#define FDCAN1_TTIR_GTD         (0x1u<<8)
#define FDCAN1_TTIR_GTW         (0x1u<<7)
#define FDCAN1_TTIR_SWE         (0x1u<<6)
#define FDCAN1_TTIR_TTMI        (0x1u<<5)
#define FDCAN1_TTIR_RTMI        (0x1u<<4)
#define FDCAN1_TTIR_SOG         (0x1u<<3)
#define FDCAN1_TTIR_CSM         (0x1u<<2)
#define FDCAN1_TTIR_SMC         (0x1u<<1)
#define FDCAN1_TTIR_SBC         (0x1u<<0)

// TTIE Configuration

#define FDCAN1_TTIE_CERE        (0x1u<<18)
#define FDCAN1_TTIE_AWE         (0x1u<<17)
#define FDCAN1_TTIE_WTE         (0x1u<<16)
#define FDCAN1_TTIE_IWTGE       (0x1u<<15)
#define FDCAN1_TTIE_ELCE        (0x1u<<14)
#define FDCAN1_TTIE_SE2E        (0x1u<<13)
#define FDCAN1_TTIE_SE1E        (0x1u<<12)
#define FDCAN1_TTIE_TXOE        (0x1u<<11)
#define FDCAN1_TTIE_TXUE        (0x1u<<10)
#define FDCAN1_TTIE_GTEE        (0x1u<<9)
#define FDCAN1_TTIE_GTDE        (0x1u<<8)
#define FDCAN1_TTIE_GTWE        (0x1u<<7)
#define FDCAN1_TTIE_SWEE        (0x1u<<6)
#define FDCAN1_TTIE_TTMIE       (0x1u<<5)
#define FDCAN1_TTIE_RTMIE       (0x1u<<4)
#define FDCAN1_TTIE_SOGE        (0x1u<<3)
#define FDCAN1_TTIE_CSME        (0x1u<<2)
#define FDCAN1_TTIE_SMCE        (0x1u<<1)
#define FDCAN1_TTIE_SBCE        (0x1u<<0)

